{
  "status": "success",
  "totalResults": 527,
  "results": [
    {
      "title": "Drei Lions in Nations League-Action während die WM-Vorbereitungen weitergehen, Ivan Toney plant sein Debüt in Mailand – Anstoßzeit, Team-News, weitere Informationen",
      "link": "https://lomazoma.com/drei-lions-in-nations-league-action-waehrend-die-wm-vorbereitungen-weitergehen-ivan-toney-plant-sein-debuet-in-mailand-anstosszeit-team-news-weitere-informationen/",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "England wird seine Vorbereitungen auf die Weltmeisterschaft in diesem Winter mit zwei Duellen in der Nations League an diesem Wochenende intensivieren. Die Three Lions von Gareth Southgate treffen in dieser Länderspielpause auf Italien und Deutschland, ihre letzten Spiele, bevor das Vorzeigeturnier Mitte November beginnt. Am Freitagabend trifft England in der Nations League auf Italien Zunächst …",
      "content": null,
      "pubDate": "2022-09-19 10:44:24",
      "image_url": null,
      "source_id": "lomazoma",
      "country": ["saudi arabia"],
      "category": ["top"],
      "language": "arabic"
    },
    {
      "title": "Prince Harry Attends Queen Elizabeth’s Royal Funeral Service Not Wearing His Military Uniform",
      "link": "https://etcanada.com/news/929632/prince-harry-attends-queen-elizabeths-royal-funeral-service-not-wearing-his-military-uniform/",
      "keywords": null,
      "creator": ["Becca Longmire"],
      "video_url": null,
      "description": "As the world watched Queen Elizabeth II‘s funeral on Monday, Prince Harry arrived wearing his morning suit and military medals. He then processed behind his grandmother’s coffin as it moved from Westminster Hall to Westminster Abbey for her State Funeral service. As has been an ongoing conversation throughout the official events surrounding the queen’s funeral, the Duke of",
      "content": "As the world watched Queen Elizabeth II‘s funeral on Monday, Prince Harry arrived wearing his morning suit and military medals. He then processed behind his grandmother’s coffin as it moved from Westminster Hall to Westminster Abbey for her State Funeral service. As has been an ongoing conversation throughout the official events surrounding the queen’s funeral, the Duke of Sussex was not permitted to wear his military uniform to the State Funeral on Monday at Westminster Abbey. Prince William, Prince of Wales and Prince Harry, Duke of Sussex follow a gun carriage carrying the coffin of Queen Elizabeth II during the State Funeral of Queen Elizabeth II at Westminster Abbey on September 19, 2022 in London, England. (Photo by Emilio Morenatti – WPA Pool/Getty Images) His father, King Charles III, and older brother, Prince William, were both seen in their uniforms. Harry relinquished his honorary military titles in 2020 when he and his wife, Meghan Markle, stepped down as senior members of the royal family. Originally, the duke was not allowed to wear his military uniform to this weekend’s vigil, but was later permitted. In regard to his uniform, a spokesperson for Harry released a statement last week, saying, “Prince Harry, The Duke of Sussex will wear a morning suit throughout events honouring his grandmother. His decade of military service is not determined by the uniform he wears and we respectfully ask that focus remain on the life and legacy of Her Majesty Queen Elizabeth II.” While he didn’t wear his uniform to the funeral, King Charles III did permit Harry to wear it while standing vigil at his grandmother’s coffin for 15 minutes of silence alongside William and their cousins. The new Prince of Wales stood at the queen’s head while the Duke of Sussex stood at her feet. William was flanked by Princess Anne’s children, Zara Tindall and Peter Phillips, while Harry was flanked by Prince Andrew’s daughters, Princess Beatrice and Princess Eugenie, with Prince Edward’s children, Lady Louise Windsor and James, Viscount Severn, at the middle of the coffin. This came after the late British monarch’s four children — King Charles III, Princess Anne, Prince Andrew, and Prince Edward — all stood at her coffin on Friday. William and Harry also processed behind their grandmother’s coffin as it travelled from Buckingham Palace to Westminster Hall on Wednesday, following the long-reigning queen’s death on Sept. 8 at age 96. The brothers famously processed behind the coffin of their late mother, Princess Diana, at her 1997 funeral. Most recently, they reunited in April 2021 to walk behind the coffin of Prince Philip during his intimate funeral in Windsor, England. MORE FROM ET: Prince George, Princess Charlotte to Join Queen’s Funeral Procession Queen Elizabeth Smiles in Final Portrait Released Ahead of Her Funeral Prince Harry, William, Queen’s Grandchildren Stand Vigil at Her Coffin Click to View Gallery Guests Arrive At Queen Elizabeth II’s State Funeral Next Slide",
      "pubDate": "2022-09-19 10:43:38",
      "image_url": null,
      "source_id": "etcanada",
      "country": ["canada"],
      "category": ["entertainment"],
      "language": "english"
    },
    {
      "title": "T20 World Cup: Couldn't have found a better partner to watch this- Yuvraj Singh relives six 6s moment",
      "link": "https://www.indiatvnews.com/sports/cricket/t20-world-cup-couldn-t-have-found-a-better-partner-to-watch-this-yuvraj-singh-relives-6-sixes-moment-yuvraj-singh-with-son-2022-09-19-809595",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "T20 World Cup: It's the 19th of September, a historic date in Indian cricket when India's Yuvraj Singh took England's Stuart Broad to the cleaners at Durban. Yuvraj achieved an iconic feat in the 19th over as he became the first Indian cricketer to smash six 6s in an over in International Cricket. He also registered the record for the fastest fifty in T20I cricket. Even after 15 years, these records stand unbeaten by any Indian cricketer.",
      "content": null,
      "pubDate": "2022-09-19 10:20:43",
      "image_url": null,
      "source_id": "indiatvnews",
      "country": ["india"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "Big Ben chimes, hymns mark start of state funeral for Queen Elizabeth II",
      "link": "https://www.business-standard.com/article/international/big-ben-chimes-hymns-mark-start-of-state-funeral-for-queen-elizabeth-ii-122091900657_1.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "The funeral service is being led by the Dean of Westminster and will include many personal touches of the late monarch, who was also the head of the Church of England",
      "content": null,
      "pubDate": "2022-09-19 10:19:59",
      "image_url": null,
      "source_id": "business-standard",
      "country": ["india"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Meghan Markle Attends Queen Elizabeth II’s State Funeral Wearing Touching Tribute",
      "link": "https://etcanada.com/news/929624/meghan-markle-attends-queen-elizabeth-iis-state-funeral-wearing-touching-tribute/",
      "keywords": null,
      "creator": ["Becca Longmire"],
      "video_url": null,
      "description": "Meghan Markle is paying her final respects to Queen Elizabeth II. The 41-year-old Duchess of Sussex attended the State Funeral of the late British monarch on Sunday at Westminster Abbey. She arrived solo as her husband, Prince Harry, participated in the procession behind the queen’s coffin from Westminster Hall to Westminster Abbey. The duchess wore a wide-brimmed black hat, black dress",
      "content": "Meghan Markle is paying her final respects to Queen Elizabeth II. The 41-year-old Duchess of Sussex attended the State Funeral of the late British monarch on Sunday at Westminster Abbey. She arrived solo as her husband, Prince Harry, participated in the procession behind the queen’s coffin from Westminster Hall to Westminster Abbey. The duchess wore a wide-brimmed black hat, black dress with attached cape, black tights and heels. She was wearing the pearl and diamond drop earrings that the late monarch gifted her during their first solo outing together in 2018. Her hair was slicked back into an elegant bun. Following the funeral, Markle is expected to join Sophie, the Countess of Wessex, who is the wife of the queen’s youngest son, Prince Edward, in a car behind the procession. Prince Harry is participating in the procession alongside his father, King Charles III, and older brother, Prince William. The procession will take the coffin from Westminster to Wellington Arch. From there the coffin will travel to the nearby Windsor, England, where the State Hearse will travel in procession to St. George’s Chapel, Windsor Castle via the Long Walk. A Committal Service will then take place in St George’s Chapel, the queen’s final resting place. Harry and Meghan have been somewhat estranged from the royal family since their decision to step down as senior members and to relocate their own family to California in 2020. But since the queen’s death earlier this month, they have been spotted out several times with the royals. Prince William invited Harry and Meghan to join him and wife Kate Middleton outside of Windsor Castle to greet mourners last week. Harry and Meghan also joined the royals to receive the queen’s coffin at Buckingham Palace. Harry was a part of the procession of the coffin from Buckingham Palace to Westminster Hall, and met Meghan at Westminster for the Service for the Reception of Her Majesty’s Coffin. On Saturday, Harry alongside William and their cousins all stood guard at the queen’s coffin in a touching vigil. MORE FROM ET: Why Titles of Prince Harry, Meghan Markle’s Children Matter to Royals Meghan Markle Gets Hug From Teen Girl While Mourning Queen Elizabeth Meghan Markle & Kate Middleton Honoured Queen Elizabeth at Her Service Click to View Gallery Guests Arrive At Queen Elizabeth II’s State Funeral Next Slide",
      "pubDate": "2022-09-19 10:13:05",
      "image_url": null,
      "source_id": "etcanada",
      "country": ["canada"],
      "category": ["entertainment"],
      "language": "english"
    },
    {
      "title": "Trauerfeier für Queen Elizabeth II.: Zehn der wichtigsten Momente ihres Lebens",
      "link": "https://www.watson.de/unterhaltung/geschichte/922759558-queen-elizabeth-ii-die-wichtigsten-momente-und-bilder-ihres-lebens",
      "keywords": null,
      "creator": ["Ronja Brier"],
      "video_url": null,
      "description": "Zehn der wichtigsten Momente ihres Lebens",
      "content": "Queen Elizabeth II. regierte 70 Jahre lang in Großbritannien. Bild: Getty Images Europe / WPA PoolIhr Amtsantritt kam völlig überraschend – auch für sie selbst. 1952 wurde Elizabeth nach dem plötzlichen Tod ihres Vaters Königin von England. 70 Jahre lang prägte sie das Bild der britischen Monarchie und des gesamten Landes. Das ist eine Zeitspanne, in der viel passiert ist und in der sie auch persönlich viel erlebt hat.Zum Tod und zur Trauerfeier der Königin hat watson die zehn wichtigsten Momente ihres Lebens zusammengestellt: Die zehnjährige Elizabeth wird plötzlich Thronfolgerin, als ihr Onkel König Edward VIII. abdankt. Bild: Everett Collection / imagoElizabeth war gerade zehn Jahre alt, als König Edward VIII., der ihr Onkel war, plötzlich abdankte. Er wollte die geschiedene US-Amerikanerin Wallis Simpson heiraten – und konnte damit nicht mehr König sein. Durch diesen Schritt wurde Elizabeths Vater Prinz Albert automatisch König – und sie selbst die nächste Thronerbin. ...(Auf https://www.watson.de lesen)",
      "pubDate": "2022-09-19 10:11:57",
      "image_url": null,
      "source_id": "watson",
      "country": ["germany"],
      "category": ["entertainment"],
      "language": "german"
    },
    {
      "title": "Princess Eugenie wears black headwear and coat-dress to the Queen’s funeral",
      "link": "https://metro.co.uk/2022/09/19/princess-eugenie-wears-black-headwear-and-coat-dress-to-the-queens-funeral-17400212/",
      "keywords": [
        "Fashion",
        "Princess Eugenie",
        "Queen Elizabeth II",
        "Royal Family"
      ],
      "creator": ["Dayna McAlpine"],
      "video_url": null,
      "description": "Princess Eugenie honoured her Grannie in a sweet way.",
      "content": "Princess Beatrice and Edoardo Mapelli Mozzi arriving at the State Funeral of Queen Elizabeth II, held at Westminster Abbey, London (Credits: PA) Princess Eugenie arrived at the Queen’s funeral dressed head-to-toe in black to mourn her late grandmother. Eugenie teamed an all-black outfit of a long black coat-style dress with gold button detailing. She paired the outfit with a wide brimmed hat, black tights and a pair of heels. She arrived at Westminster Abbey with her sister, Princess Beatrice, by her side. Princess Eugenie also arrived with Mike Tindall and Zara Tindall, her husband Jack Brooksbank and Princess Beatrice’s husband Edoardo Mapelli Mozzi. The Princesses originally entered the church with their mother Sarah Ferguson, the Duchess of York. The sisters had a close relationship with Queen Elizabeth II, who they simply referred to as ‘Grannie’. Princess Eugenie arrives at Westminster Abbey with husband Jack Brooksbank (Photo by Phil Noble – WPA Pool/Getty Images) Having grown up living in close proximity to Windsor castle, the York family would often journey over to visit the late monarch, who was said to have a ‘maternal’ relationship with the girls. Royal author Angela Levin once said that the Queen ‘felt more maternal towards Beatrice and Eugenie and could see that they’d had a very hard time’. Eugenie hasn’t often worn the Queen’s jewellery, but opted for two significant pieces for her wedding day. The first was the grand Greville Emerald Kokoshnik tiara, left to the Queen by the Queen Mother but left unworn until 2018, when Elizabeth II lent this special piece to Eugenie for her big day. The Queen lent Princess Eugenie the Greville Emerald Kokoshnik tiara for her wedding day (Picture: Pool/Samir Hussein/WireImage) Queen Elizabeth II dead: Latest updates What time is the Queen’s funeral today and where is it taking place? Queen’s last official portrait released ahead of her funeral Drivers told ‘avoid central London’ with major road closures for Queen’s funeral Full schedule for the Queen's funeral and committal service Head to Metro.co.uk's Queen Elizabeth II tag page for the latest updates, and sign Metro.co.uk's book of condolence to Her Majesty here. {\"@context\":\"https://schema.org\",\"@type\":\"VideoObject\",\"name\":\"Metro.co.uk\",\"duration\":\"T40S\",\"thumbnailUrl\":\"https://i.dailymail.co.uk/1s/2018/10/14/12/5034166-0-image-a-3_1539515745352.jpg\",\"uploadDate\":\"2018-10-14T12:14:19+0100\",\"description\":\"Princess Eugenie and Jack Brooksbank have release official photos from their wedding, including a group photograph taken in the White Drawing Room at Windsor that shows both the bride and groom's families.\",\"contentUrl\":\"https://videos.metro.co.uk/video/met/2018/10/14/792148193978372077/480x270_MP4_792148193978372077.mp4\",\"height\":270,\"width\":480} To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video The second was more low-key: at Eugenie’s wedding reception, her hair slide was in fact a brooch owned by Her Majesty the Queen – Queen Victoria’s wheat-ear brooches, which the Queen wore multiple times throughout her reign. Along with Princess Beatrice, Princess Eugenie paid a powerful tribute to the Queen upon her death, writing: ‘Our dearest Grannie, We’ve not been able to put much into words since you left us all. ‘There have been tears and laughter, silences and chatter, hugs and loneliness, and a collective loss for you, our beloved Queen and our beloved Grannie. ‘We, like many, thought you’d be here forever. And we all miss you terribly. The Queen was said to have a very ‘maternal’ relationship with her granddaughter, Princess Eugenie (Picture: Max Mumby/Indigo/Getty Images) ‘You taught us so much and we will cherish those lessons and memories forever’ (Picture: Max Mumby/Indigo/Getty Images) ‘You were our matriarch, our guide, our loving hand on our backs leading us through this world. You taught us so much and we will cherish those lessons and memories forever. ‘For now dear Grannie, all we want to say is thank you. Thank you for making us laugh, for including us, for picking heather and raspberries, for marching soldiers, for our teas, for comfort, for joy. You, being you, will never know the impact you have had on our family and so many people around the world. ‘The world mourns you and the tributes would really make you smile. They are all too true of the remarkable leader you are. ‘We’re so happy you’re back with Grandpa. Goodbye dear Grannie, it has been the honour of our lives to have been your granddaughters and we’re so very proud of you. ‘We know that dear Uncle Charles, the King, will continue to lead in your example as he too has dedicated his life to service. ‘God save the King. ‘With our love, Beatrice and Eugenie.’ A guide to some of the Queen's most iconic brooches and their meanings Queen Elizabeth II had a collection of more than 100 brooches, but there were some that held extra special meaning. Here's your cheat sheet. The sapphire chrysanthemum brooch The Queen and Prince Philip's honeymoon photos (Picture: Topical Press Agency/Hulton Archive/Getty Images) Elizabeth wore this brooch for the Christening of Princess Anne (Picture: ullstein bild/ullstein bild via Getty Images) Queen Elizabeth II and Prince Philip, The Duke of Edinburgh re-visit Broadlands, to mark their Diamond Wedding Anniversary on November 20 (Picture: Tim Graham/Getty Images) The Sapphire chrysanthemum brooch is a simple but statement design, with multiple platinum-set sapphires surrounded by diamond petals. It was given to the then Princess Elizabeth for launch the British Princess oil tanker in 1946, and she went on to wear it for many key moments, including her honeymoon, Princess Anne's Christening, and her and Prince Philip's diamond wedding anniversary. The Dorset bow brooch At the Christening of Charles (Picture: mirrorpix/Mirrorpix/Mirrorpix via Getty Images) A family heirloom, the Dorset bow brooch was Queen Mary's wedding gift from the county of Dorset. It was then given to Elizabeth for her wedding, and she went on to wear it frequently, including for the Christening of Prince Charles. It was often used to symbolise remembrance - the Queen wore it for many Remembrance Day events, as well as for the funeral of the Duke of Windsor. The Queen Mother’s art deco leaf brooch Yes, that is Charles (Picture: INTERCONTINENTALE / AFP) (Photo by -/INTERCONTINENTALE/AFP via Getty Images) Crafted by Cartier in 1928, this brooch was passed along quite a bit, given by King George VI to Queen Elizabeth the Queen Mother, then to Queen Elizabeth II (Princess Elizabeth at the time) as a birthday present. She wore it many times in the 1950s, including in the moment above, when she touched down in London after a trip to Italy. The aquamarine clip brooches The set was made by Boucheron ten years before being given to Elizabeth on her 18th birthday (Picture: Jack Hill - WPA Pool/Getty Images) She often wore the pin pair with blue-toned outfits (Picture: Chris Jackson - WPA Pool/Getty Images) These twin brooches were Queen Elizabeth II's 18th birthday gift from her parents, so it's no surprise that the monarch absolutely adored them. She wore the set many, many times during her reign, especially on anniversaries connected to her father's memory, such as on the date of her Jubilee. You'll spot the striking blue duo in photos from the Queen's message for her diamond Jubilee in 2012, for lunch with the Obamas in 2016, and for the opening of Parliament in 2021. The diamond clematis brooch The first official photograph of Princess Elizabeth with her fiance Philip Mountbatten at Buckingham Palace, in 1947 (Picture: Central Press/Getty Images) And here she is wearing the same brooch in 2014 (Picture: Chris Watt/Getty Images) Queen Elizabeth wore this gloriously sparkly diamond brooch for her official engagement photos, and went on to bring it out multiple times over the next decades. The City of London lily brooch Celebrating the Queen Mother's 101st birthday (Picture: Sion Touhig/Getty Images) Elizabeth was given this hefty diamond-encrusted lily design when she received the Freedom of the City of London. She went on to wear it a bunch, most notably for the Queen Mother's 101st birthday and the private service for Princess Margaret. The flower basket brooch The Queen wore this joyous style for many celebrations (Picture: Tim Graham Photo Library via Getty Images) This colourful style was another gift from the Queen's parents, this time to mark the birth of Charles. Years on, she wore it for Prince George's Christening, too. Queen Adelaide's brooch The Queen Adelaide brooch was passed down from the Queen Mother to Elizabeth (Picture: JOHN STILLWELL/POOL/AFP via Getty Images) You might recognise this diamond brooch from the opening ceremony of the 2012 Olympics. It was created for King William IV's consort, Queen Adelaide, reusing other jewels to form what was intended as a clasp for a pearl necklace. It has a large centre diamond, six around it, and smaller stones to complete the design. The Kent amethyst brooch Worn here with the matching earrings and necklace, in Portugal in 1985 (Picture: Tim Graham Photo Library via Getty Images) The Kent amethyst brooch is actually multiple brooches. The main part is the one you'll see most often, the top hexagonal amethyst surrounded by diamond sun rays. This has some small loops at the bottom, allowing for three smaller amethysts to be attached. It's thought that there may be some additional brooch parts, but that these were rarely worn or were attached to the matching necklace instead. The set was owned by Queen Victoria's mother, the Duchess of Kent, who left it to her daughter, who then passed it down again. Queen Elizabeth II was given the sparkling jewels after her accession, and wore the different parts many times over the years. Prince Albert's sapphire and diamond brooch (also known as Queen Victoria's wedding brooch) President John F Kennedy and First Lady Jackie Kennedy pay a visit to the royal family (Picture: Bettmann Archive) The Queen wore this brooch for Prince William's Christening, too (Picture: by Tim Graham Photo Library via Getty Images) Queen Elizabeth II visits the Children's Wood Project, a community project in Glasgow as part of her traditional trip to Scotland for Holyrood Week on June 30, 2021 (Picture: Andrew Milligan-WPA Pool/Getty Images) Prince Albert gave this brooch - a massive sapphire set in gold and surrounded by 12 diamonds - to Queen Victoria the day before their wedding, and she went on to wear it over and over again until Albert passed away. It was passed down to the Crown and once in Queen Elizabeth II's posession, became one of her favourites. She wore this brilliant blue piece for Prince William's Christening as well as for her Christmas message in 2019. Queen Victoria's diamond bow brooches Britain's Queen Elizabeth II and Britain's Prince Philip, Duke of Edinburgh, leave St Paul's Cathedral at the end of the ceremonial funeral of British former prime minister Margaret Thatcher (Picture: LEON NEAL / AFP) (Photo by LEON NEAL/AFP via Getty Images) Yep, plural - but Queen Elizabeth II only really wore one at a time. This was a set of three bow-shaped diamond brooches, commissioned by Queen Victoria from Garrard and passed down to Alexandra, then to Mary, then to Elizabeth I, then finally to Queen Elizabeth II. The Queen wore pieces of this set for many Remembrance events as well as Margaret Thatcher's funeral. Queen Victoria's ears of wheat Here the Queen is wearing one of the six brooches as a hair accessory (Picture: Tim Graham Photo Library via Getty Images) And here are two worn as brooches, in Oman (Picture: Chris Jackson/Getty Images) Another set that's larger than you might realise. There are in fact six of these large diamond ears of wheat, but the Queen typically wore two at a time. They were made for Queen Adelaide at the request of her husband by Rundell, Bridge & Co, then redone by Garrard in 1858. Queen Elizabeth II wore the wheat ears not only as brooches but as hair ornaments, too, and lent them to Princess Eugenie for her wedding reception. The Cambridge emerald cluster brooch M Queen Elizabeth II arrives at Holden Point to view the 2012 Olympic park site (Picture: Chris Jackson/Getty Images) A round emerald surrounded by diamonds, with the option to dangle another Cambridge emerald pendant. Cambridge pearl pendant brooch The Queen wore this simple pearl brooch for her 50th birthday portrait (Picture: Bettmann Archive) This pretty pearl brooch belonged to the Duchess of Cambridge - no, not Kate, but Queen Mary's grandmother, Princess Augusta. In 1953, Queen Mary then passed it down to Elizabeth II. The late monarch wore the piece for her 50th birthday portrait, for her 2014 Christmas message, and in a Zoom call in 2021. The Queen Mother's palm leaf brooch (also known as the paisley brooch) Queen Elizabeth II attends the wedding of Lady Gabriella Windsor and Mr Thomas Kingston at St George's Chapel on May 18, 2019 in Windsor, England (Picture: Mark Cuthbert/UK Press via Getty Images) One of the Queen's most frequently worn brooches, this is a simpler diamond design in the shape of a leaf. The Queen Mother loved this particular piece of jewellery, wearing it repeatedly throughout her life - including while mourning King George VI. Queen Alexandra's wedding gift brooch Queen Elizabeth II and Prince Philip, Duke of Edinburgh in the Royal Box at the Royal Albert Hall during the Annual Festival of Remembrance on November 7, 2015 (Picture: Chris Jackson - WPA Pool/Getty Images) Here, the Duchess wears the matching necklace (Picture: John Stillwell - WPA Pool/Getty Images) This brooch forms part of a grand Garrard set made for Princess Alexandra of Denmark for her wedding, comprised of a large diamond tiara, a diamond and pearl necklace, a set of earrings, and a brooch. The Queen often wore the brooch, particularly for Remembrance events, and the earrings, while Kate Middleton and the Queen Mother have been spotted wearing the necklace. The modern diamond and ruby spray brooch Queen Elizabeth II talks with MI5 officers during a visit to the headquarters of MI5 at Thames House on February 25, 2020 (Picture: Victoria Jones - WPA Pool/Getty Images) The Queen often wore this with red outfits, for obvious reason: the rubies made the brooch a natural accessory. She wore it for multiple state dinners and her diamond Jubilee walk. Queen Mary's Richmond brooch Elizabeth II wore this hefty brooch for Meghan and Harry's weddin Pool/Max Mumby/Getty Images) A super ornate pearl and diamond design that the Queen wore for the wedding of Harry and Meghan. Queen Mary's pink sapphire and diamond brooch Queen Elizabeth II attends Christmas Day Church service at Church of St Mary Magdalene on the Sandringham estate on December 25, 2018 (Picture: UK Press Pool/UK Press via Getty Images) A sweet pink sapphire, surrounded by large round diamonds and smaller diamonds between the stones, the Queen wore this one frequently through the years, including for a portrait (by Mary McCartney, daughter of Paul) to commemorate her becoming the longest-reigning British monarch. True lover's knot brooch The Queen wore the true lover's knot brooch for Kate and William's wedding (Picture: Chris Jackson/Getty Images) Another one of the Queen's diamond bows, this appears to be the largest of the bunch. It was made by Garrard for Queen Mary and inherited by Elizabeth II in 1953. She often wore it to hold her poppy on Remembrance Day, and donned it for Will and Kate's wedding in 2018. The New Zealand silver fern brooch Here's the Queen wearing the New Zealand fern brooch in an official portrait... (Picture: Pool/Samir Hussein/WireImage) And here's Kate wearing that very same brooch on the same tour of New Zealand (Picture: Pool/Samir Hussein/WireImage) As the name suggests, the Queen wore this brooch for events related to New Zealand, after being given it by the wife of the Mayor of Auckland for Christmas in 1953. Elizabeth II even lent it to Kate, now the Princess of Wales, for her tour of New Zealand in 2014. The pearl triangle brooch The Queen had this brooch since at least the 1950s (Picture: Mark Large - WPA Pool /Getty Images) One of the more delicate, smaller pearl brooches owned by the Queen, comprised of two pearls and a yellow diamond set in a diamond frame. Elizabeth wore this for her walkabout outside St James Palace on the day before Princess Diana's funeral, as well as for a wedding anniversary portrait in 1979. The golden dahlia brooch (also known as the golden sunflower brooch) An obvious choice for the Chelsea Flower Show in 2003 (Picture: Anwar Hussein/Getty Images) Another work by Garrard, the Queen clearly loved this accessory, wearing it for public appearances at least 40 times. It has a diamond flower (dahlia or sunflower? That's up to you...) surrounded by 18 carat gold petals. The grima ruby brooch (also known as the scarab brooch) It's quite the statement piece (Picture: Mark Cuthbert/UK Press via Getty Images) The Queen received this brooch - made up of repurposed rubies, gold, and diamonds and created by jeweller Andrew Grima - from the Duke of Edinburgh, and went on to wear it in tribute to the Duke after his passing. Elizabeth also opted for this brooch for her 70th wedding anniversary portrait. The Jardine star brooch Queen Elizabeth II arrives to address both Houses of Parliament at Westminster Hall on March 20, 2012 (Picture: Toby Melville - WPA Pool/Getty Images) This one feels quite Christmassy, no? The Jardine star was left to the Queen by Lady Jardine, and has eight twinkling diamond rays that surround a central cluster of eight diamonds. The diamond and pearl leaf brooch The Queen wore this pearl and diamond leaf brooch in 1999, and passed it on to Kate Middleton in later years (Picture: PA) The Princess of Wales wore the piece for the procession of the Queen's coffin (Picture: Marco BERTORELLO / AFP) Kate, Princess of Wales, wore this brooch to the procession of the Queen's coffin. This isn’t one of Queen Elizabeth II’s most well-known brooches – in fact, it’s rarely been seen. The Queen was spotted wearing it on a yellow dress back in 1999, in Seoul, but we knew it had been passed along to Kate more recently, as the Princess of Wales donned it for a visit to Belgium. Queen Victoria's 11 pearl and diamond brooch LONDON, ENGLAND - MARCH 13: Queen Elizabeth II departs a Service of Commemoration for troops who were stationed in Afghanistan on March 13, 2015 in London, England. (Photo by Chris Jackson/Getty Images) Another pearl brooch that belonged to Queen Victoria, this one has 11 large pearls; eight in a diamond shape and three hanging down as pendants. It was handed to the Crown and worn frequently by the Queen Mother until 2002, when it was passed on to Queen Elizabeth II, who has worn it multiple times to the Royal Windsor Horse Show. The Courtauld Thomson scallop shell brooch (also known as the Queen Mother's shell brooch) Queen Elizabeth, The Queen Mother, arrives at The Guildhall with Princess Margaret, London, for a lunch to celebrate her 100th Birthday, 27th June 2000 ((Picture: Colin Davey/Getty Images) After her mother's death, Queen Elizabeth II wore this statement brooch often (Picture: Max Mumby/Indigo/Getty Images) A rather grand design in the shape of a shell, this has solid rows of diamonds with a pearl at the base. It was designed by Lord Courtauld-Thomson for the Queen Mother, who went on to wear it frequently - including for her 100th birthday celebrations. After the Queen Mother died, Elizabeth II took the shell brooch into her collection and wore it on multiple occasions, including Royal Ascot, a funeral, Remembrance Sunday, an Easter service, and her 2020 Christmas broadcast The Braemar feather brooch The Queen was given this eagle feather brooch for her golden Jubilee - it has a Jubilee stamp on the back (Picture: Chris Jackson/Getty Images) She wore it for every Braemar Gathering after that (Picture: Anwar Hussein/Getty Images) The Braemar Royal Highland Society gave this eagle's feather brooch - made with 24 carat yellow gold, white gold, silver, and platinum - to the Queen to mark her golden Jubilee. After that, the Queen wore this every year, for the annual Braemar Gathering. The Queen Mother's Cartier lily brooch Spot that long thing on the Queen's left shoulder? Yep, that's the Cartier brooch (Picture: Lewis Whyld /WPA Pool/Getty Images) This weighty design is sometimes called a footlong, but in fact measures in at just under 7 inches long... which is still giant for a brooch. Picture a 6inch Subway sandwich on your lapel - it'd make quite the statement. The brooch, of course, is not made of bread and your choice of fillings, but instead more than 200 diamonds from the Queen Mother's collection, then an extra 50 added by Cartier for good measure. The dramatic piece was commissioned in 1939 for the Queen Mother, and has a long stem with a lily flower design at the top. Because of its size, Queen Elizabeth II didn't wear it often, but when she did, you couldn't help but marvel at it. The Queen Mother's aquamarine art deco brooch Queen Elizabeth II attends Trooping Of The Colour in 2021 (Picture: Chris Jackson/Getty Images) You will have spotted this pinned to many of Queen Elizabeth II's blue outfits, for obvious reasons. It's not known who made this particular piece, but many believe it's another Cartier classic. After the Queen Mother's death, Elizabeth II inherited the brooch and went on to wear it for one of her Christmas messages. The centenary rose brooch Queen Elizabeth II arrives by carriage as she attends Royal Ascot Day 3 at Ascot Racecourse on June 21, 2018 (Picture: Samir Hussein/Samir Hussein/WireImage) Christmas Day church service, 25 December 2004 (Picture: CHRIS RADBURN/AFP via Getty Images) Elizabeth II commissioned this pretty piece from Collins and Sons for the Queen Mother's 100th birthday. It has a hand-painted Grandiflora Rose - a flower grown by the Queen Mother - surrounded by 100 diamonds. The Queen went on to wear it after her mother's death, including for the Royal Windsor Horse Show and the 2004 Christmas service. MORE : A guide to some of the Queen’s most iconic brooches and the meaning behind them MORE : Camilla, Beatrice and Eugenie arrive at Buckingham Palace for Queen’s procession MORE : Why the Royal Family wear pearls in times of mourning",
      "pubDate": "2022-09-19 10:05:44",
      "image_url": "https://metro.co.uk/wp-content/uploads/2022/09/SEI_126038319-b1da.jpg?quality=90&strip=all",
      "source_id": "metro",
      "country": ["united kingdom"],
      "category": ["top"],
      "language": "english"
    },
    {
      "title": "Watch: Yuvraj Singh's 'six sixes' in one over against England's Stuart Broad in ICC T20 Wold Cup 2007",
      "link": "https://zeenews.india.com/cricket/this-day-that-year-yuvraj-singh-became-first-t20i-player-to-smash-six-sixes-in-one-over-in-2007-t20-world-cup-watch-2511891.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "After exchanging a few heated words with all-rounder Andrew Flintoff, Yuvraj was all fired up, all set to unleash his hard-hitting game against England.",
      "content": "On this day in 2007, former Indian all-rounder Yuvraj Singh became the first-ever T20I batter and second batter in international cricket after South Africa's Herschelle Gibbs (ODI) to smash six sixes in an over, against England at Durban during the ICC T20 World Cup 2007. It was the Super Eight phase of the World Cup. After losing their first matches, both India and England desperately needed a win to boost their chances in semis. It's been 15 years since Yuvraj Singh's carnage on Stuart Broad by smashing him for 6 sixes in an over. What an unforgettable event that was for India! pic.twitter.com/eZL7KSLAI0 — Mufaddal Vohra (@mufaddal_vohra) September 19, 2022 India were dominating their second Super Eight match against England, at 171/3 in 18 overs after choosing to bat first. After exchanging a few heated words with all-rounder Andrew Flintoff, Yuvraj was all fired up, all set to unleash his hard-hitting game against England. But what happened later was unprecedented in the shortest format of the game. Stuart Broad, who came to bowl the 19th over, was smashed for 6,6,6,6,6,6. Flintoff and Yuvraj had an argument and it was Broad who paid the price. The pacer was smashed all over the park, with one six going to the cow corner, the second one a flick over backward square leg, the third being a hit over extra cover region. The fourth ball saw Yuvraj smash a full toss to the backward point region, making it four sixes in a row. The southpaw smashed the fifth ball over midwicket region. The final and landmark-making sixth six was smacked over the mid-on region, much to the delight of Indian fans in the crowd. With this, he also reached his half-century, the fastest in T20I cricket history, in just 12 balls. \"And he has put it away...YES! Six sixes in an over. Yuvraj Singh finishes things off in style!\" these words of commentator and former cricketer Ravi Shastri were the finishing touches that this remarkable moment needed and deserved. These words still ring in the ears of millions of fans. Thanks to these sixes, India finished things at 218/4 in 20 overs, with Yuvraj scoring 58 off just 16 balls with three fours and seven sixes and a massive strike rate of 362.50. Contributions from openers Gautam Gambhir (58) and Virender Sehwag (68) also helped Men in Blue reach this score. Chasing 219, England could only score 200/6 in their 20 overs. Knocks from Vikram Solanki (43) and Kevin Pietersen (39) were solid, but pacer Irfan Pathan (3/37) and RP Singh (2/28) kept the run flow in control to help Team India win the match by 18 runs.",
      "pubDate": "2022-09-19 10:00:00",
      "image_url": null,
      "source_id": "zeenews",
      "country": ["india"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "10 takeaways from the Patriots’ win over the Steelers",
      "link": "https://www.patspulpit.com/2022/9/19/23360369/10-takeaways-patriots-steelers-nfl-week-2",
      "keywords": null,
      "creator": ["Pat Lane"],
      "video_url": null,
      "description": null,
      "content": "The New England Patriots left Pittsburgh with a win over the Steelers , and are now 1-1 on the season. Their 17-14 victory may not have been the prettiest of all time, but, in the NFL, all that matters is that you get the W. So with that said, let’s get into the takeaways from the Patriots’ first win of the season. Mac Jones struggles: After a great rookie year, Mac Jones has looked a bit lost the first two games of this season. He had some questionable throws, including an interception and another that was eventually dropped by the defender. He also seemed to make up his mind about where he was going before the snap, which led to a few incompletions where there could have been easy completions. A good example of this was when he forced a throw to a triple-covered Jonnu Smith on third down with Jakobi Meyers by himself in the flat. Jones wasn’t making a lot of these mistakes last year, so there is hope that this is something he can clean up along the way. Fact is, if the Patriots want to be good on offense they are going to need their QB1 to be much better than he has been. Nelson Agholor has his best game as a Patriot: The Patriots needed a spark at the end of the first half, and Agholor stepped up and delivered it. With under 30 seconds left before intermission, Jones threw a deep ball up for Agholor down the right sideline, and the wideout went up and snatched it away from cornerback Ahkello Witherspoon for a 44-yard touchdown. That wasn’t all Agholor did, though; he had some nice shorter catches as well and was great gaining additional yards after the reception. As a result, he is now the first Patriot to have 100+ receiving yards in a game since Mac Jones entered NFL last year. The team needs more playmakers on offense, and Agholor came through on Sunday. Tight ends are non-factors: Both Jonnu Smith and Hunter Henry were held without a catch on Sunday, with only four combined targets between the two of them. Henry was one of the most reliable pass catchers for Jones last year, but his blocking was put in question in last week’s game. This is obviously important, but Jones felt confident throwing to Henry last year and you would like to see him get more involved. Smith, meanwhile, can be electric with the ball in his hands but seems to be a guy that needs to be schemed up to get touches, which can be tough on a week-to-week basis. Either way, the duo needs to find a way to be more involved because the offense is better with both of them playing well and creating mismatches especially in the passing game. The offensive line impresses: The Patriots offensive line was a big talking point all week, and it did a great job, keeping Mac Jones upright, and not allowing a single sack to a team that took down Cincinnati Bengals QB Joe Burrow seven times the previous week. Rookie guard Cole Strange looked particularly good, and seems to be coming into his own quickly. The unit was also able to put an exclamation point on the game, when it killed the clock in the late fourth quarter, and ended the game in victory formation. The Steelers punted to the Patriots, and they took over at the 30 yard line with 6:33 to go. New England proceeded to go on a 13-play, 46-yard drive, that featured only one pass thrown. The Patriots simply ran the ball down the home team’s throat, and there was nothing it could do about it. That was a dominant performance, and something that, hopefully, the entire operation can build on moving forward. Patriots vs. Steelers: New England beats Pittsburgh 17-14, improve to 1-1 Instant analysis from Patriots’ 17-14 win over Steelers Offensive line draws positive reviews after Patriots’ win over Steelers Ability to close out win over Steelers a ‘huge confidence booster’ for the Patriots New England has a two-headed monster at running back: The Patriots have a heck of 1-2 punch at running back right now. Both Damien Harris and Rhamondre Stevenson had solid games again, with Harris registering 71 yards and a touchdown and Stevenson going for 47 yards. Both are tough to tackle, and bring explosiveness to the backfield. Without receiving back Ty Montgomery for at least four weeks, New England might be looking for them both to catch more passes out of the backfield. The two have looked good doing that this year, combining to catch three passes for 20 yards on Sunday. Having both Harris and Stevenson playing well is obviously good news for the offense, because it can cycle them in and out of the lineup and keep both fresh throughout the game. All in all, the running attack was very effective in Pittsburgh, and it could be one of the strongest units on the team if the line keeps blocking the way it did. DeVante Parker’s struggles continue: Patriots offseason acquisition DeVante Parker has struggled the first two games of the season. He appeared unsure at times about what he was being asked to do and has only one catch through two games, while Mac Jones has been picked twice when targeting him. Parker was brought in because of his big-play ability and jump-ball prowess, and, so far, he hasn’t shown off either. He is going to need to play significantly better moving forward, and the Patriots are willing to give him every opportunity he can get to build a rapport with Jones. However, I’m starting to wonder if maybe he should actually be playing less than he is right now. Kendrick Bourne is still not playing enough. Speaking of wideout playing time, Kendrick Bourne should be seeing more. Maybe some of Parker’s snaps could go to him, or he could be more involved in multi-receiver sets. No matter how the Patriots do it, when Bourne is on the field he makes plays and has proven himself a reliable target for Mac Jones. However, he was once again the receiver with the least amount of snaps (even being out-snapped by Lil’Jordan Humphrey again). Bourne was one of Jones’ favorite targets down the stretch last year, and the young QB appears to play better when he is on the field. The Patriots need to figure out a way to make that happen and give that connection an opportunity to shine again. Speed and athleticism are showing up on defense: The Patriots made a few moves to try to become faster and more athletic on defense this offseason. That started to show up on Sunday. Linebacker Mack Wilson made a great play in pass coverage, tipping a ball that was eventually picked by cornerback Jalen Mills. That was a play that Patriots linebackers haven not been able to make in years past. The injury bug is biting the Patriots defense: Speaking of the Patriots defense, it had a few players suffer some injuries that bear watching this week. Davon Godchaux, Ja’Whaun Bentley, Jonathan Jones, and Kyle Dugger all left the game at one point because of apparent injuries. Even though Bentley and Godchaux both ended up back in the game, the health of all four will be crucial moving forward given their prominent roles. With all of the speed coming into town next week in the form of the Baltimore Ravens ’ potent offense, the Patriots are going to need all the help they can get. Speaking of whom... A tough test coming up: The Patriots have their home opener next week, and it is going to be a tough one. The Ravens, who lost a heartbreaker to the Miami Dolphins on Sunday, will visit Gillette Stadium and bring one of the most electric offenses in the NFL with them (one that should also be getting J.K. Dobbins back). The Ravens defense played pretty well against the New York Jets last weekend, but they look like they might be able to be exploited a bit; the Patriots better be able to do so, because keeping the Ravens from scoring under 20 points is going to be a tough task. For now, however, let’s focus on the Patriots’ first victory of the season. Even if it wasn’t particularly pretty at all times, a win is a win. There is still a long way to go for this team, but getting in the win column is a step in the right direction.",
      "pubDate": "2022-09-19 10:00:00",
      "image_url": null,
      "source_id": "patspulpit",
      "country": ["united states of america"],
      "category": ["sports"],
      "language": "english"
    },
    {
      "title": "The Queen’s funeral order of service in full",
      "link": "https://metro.co.uk/2022/09/19/the-queens-funeral-order-of-service-in-full-17403573/",
      "keywords": [
        "UK",
        "Queen Elizabeth II",
        "Royal Family",
        "Westminster Abbey"
      ],
      "creator": ["Jordan King"],
      "video_url": null,
      "description": "The service will include Bible readings, hymns and the national anthem.",
      "content": "Some of the world’s most powerful leaders are gathering to say goodbye to Britain’s longest-reigning monarch in a historic ceremony today. The doors to Westminster Abbey opened this morning for the 2,000 people invited to Queen Elizabeth II’s state funeral. Her Majesty’s coffin was removed from Westminster Hall at 10.45am and is currently being carried by state gun carriage to the Abbey. The monarch, and the procession which will follow her coffin, will arrive at the Abbey in time for the funeral service to start at 11am. Here is every detail of what will happen from then until the end of the service just before noon. Music will play as representatives from almost every religion, along with the Churches of Wales, Scotland, Northern Ireland and England, take their place in the Abbey’s nave. All attendees will be asked to stand as the Queen’s coffin arrives and is carried through the church to the sound of the Choir of Westminster singing. Head to Metro.co.uk's Queen Elizabeth II tag page for the latest updates, and sign Metro.co.uk's book of condolence to Her Majesty here. Several Bible verses will be read out before the Dean of Westminster gives the Bidding – a type of prayer. After everyone has prayed, they will all sing The Day Thou Gavest Lord is Ended – one of Britain’s most popular funeral hymns about God’s eternal life and love after death. The congregation will then be invited to sit to listen to the first lesson, read by the secretary-general of the Commonwealth Patricia Scotland KC. The choir will sing before prime minister Liz Truss reads the second lesson, all about the joy promised to Christians in heaven. Everyone will then stand to sing another hymn, The Lord is my Shepherd, I’ll Not Want, before the Archbishop of Canterbury gives the main sermon. The choir will sing again and then the Abbey’s Reverend Mark Birch will lead a praying session, which other church leaders will join in on at different points. People can either stay seated or kneel during this part. The precentor leading the choir will finish off the next song with The Lord’s Prayer, before everyone stands to sing Love Divine, All Loves Excelling – a hymn praising God for eternal love and salvation. While the congregation is still standing, the Archbishop of Canterbury will give the commendation – entrusting the Queen to the love and mercy of God. The choir will sing one last time before a period of silence is kept and the congregation sings the national anthem. There will then be another procession following the Queen’s coffin out of the Abbey to St George’s Chapel at Windsor, where Her Majesty will eventually be laid to rest . A nationwide two-minute silence where a committal service will take place . Not convinced? Find out more »",
      "pubDate": "2022-09-19 09:52:51",
      "image_url": "https://metro.co.uk/wp-content/uploads/2022/09/SEC_125985432-2c7b.jpg?quality=90&strip=all",
      "source_id": "metro",
      "country": ["united kingdom"],
      "category": ["top"],
      "language": "english"
    }
  ],
  "nextPage": 1
}
